In [8]:
import pandas as pd
from io import StringIO

In [9]:
csv_data=\
'''A,B,C,D
1.0, 2.0, 3.0, 4.0
5.0, 6.0,,8.0
10.0, 11.0, 12.0,'''

In [10]:
df=pd.read_csv(StringIO(csv_data))

In [11]:
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

#### checking for missing value

In [12]:
df.isnull().sum()

A    0
B    0
C    1
D    1
dtype: int64

### Row Missing Value

#### Drop rows with missing value (atleast one missing value)

In [14]:
df.dropna(axis=0)

     A    B    C    D
0  1.0  2.0  3.0  4.0

#### Drop row where all value are missing (NaN)

In [16]:
df.dropna(how='all')

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

#### Thresh=3 when row have atleast 3 real value

In [18]:
df.dropna(thresh=3) #no row will be drop
df.dropna(thresh=4) # some row will be drop because not all value in the row is real value(we have mission value)

     A    B    C    D
0  1.0  2.0  3.0  4.0

### Column Missing value

#### specify the column to check for missing value

In [20]:
df.dropna(subset=['C'])

      A     B     C    D
0   1.0   2.0   3.0  4.0
2  10.0  11.0  12.0  NaN

### Note:  Learn Condition droping of Column value

### Inputing Missing Value

library used is sklearn

In [21]:
from sklearn.impute import SimpleImputer
import numpy as np

#### Inputing Missing value

It takes the average of the column and replace it with hte missing value

In [ ]:
imr=SimpleImputer(missing_values=np.nan, strategy='mean ')
imr=imr.fit(df)
imputed_data=imr.transform(df)

#### filling the missing value with the mean

In [22]:
df.fillna(df.mean())

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   7.5  8.0
2  10.0  11.0  12.0  6.0

##### Note: Types of categorical variable: 
ordinal(ranking) and norminal(hair color)

## Categorical Vairiable
Creating a data set with some categorical variables

In [24]:
df=pd.DataFrame([
    ['green', 'M', 10.1, 'class3'],
    ['red', 'L', 13.5, 'class1'],
    ['blue', 'XL', 15.3, 'class2']
])

#### Adding columns

In [26]:
df.columns=['color', 'size', 'price', 'class']

In [27]:
df

   color size  price   class
0  green    M   10.1  class3
1    red    L   13.5  class1
2   blue   XL   15.3  class2

Note: converting categorical variable advantages: reduce tspace (space complexity, and run faster (time complexity))

##### Creating a dictionary to calibrate the size

In [29]:
size_mapping={'XL':3, 'L': 2, 'M': 1}

In [30]:
df['size_1']=df['size'].map(size_mapping)

In [31]:
df

   color size  price   class  size_1
0  green    M   10.1  class3       1
1    red    L   13.5  class1       2
2   blue   XL   15.3  class2       3

In [32]:
size_mapping.items()

dict_items([('XL', 3), ('L', 2), ('M', 1)])

The next line reverse the key value pair

In [33]:
inv_size_mapping={v:k for k,v in size_mapping.items()}

In [34]:
inv_size_mapping

{3: 'XL', 2: 'L', 1: 'M'}